{
  "backend/main.mo": "Primary chat backend implementing rooms, message storage with TTL, reactions, media fields, and access control mixins.",
  "backend/migration.mo": "Migration module converting old actor state by removing user profile data while preserving messages and room metadata.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and recent updates for all major frontend and backend files.",
  "frontend/index.html": "Base HTML entry point loading the React application root and main script.",
  "frontend/REDEPLOY_TRIGGER.txt": "Trigger file used to force production redeployment without code changes.",
  "frontend/src/App.tsx": "Main React component managing theme, routing between welcome and chat views, and nickname/room state.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recorder component handling microphone permissions, timed recording, preview playback, and sending blobs.",
  "frontend/src/components/ChatRoom.tsx": "Full chat UI managing messages, reactions, media inputs, error handling, scrolling behavior, and message operations.",
  "frontend/src/components/EmojiPicker.tsx": "Emoji selection panel grouped by categories with click-to-insert behavior.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app title and optional leave-room button with icons and styling.",
  "frontend/src/components/MediaPicker.tsx": "Provides a UI for selecting GIFs or uploading custom stickers, including Tenor API integration and local sticker storage with TTL.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat messages with reactions, media handling, replies, and message actions.",
  "frontend/src/components/VideoRecorder.tsx": "Empty file with no implementation.",
  "frontend/src/components/VideoUploader.tsx": "Allows users to upload, preview, validate, and send video files with size checks and upload feedback.",
  "frontend/src/components/WelcomeScreen.tsx": "Handles room creation and joining with nickname validation, backend calls, and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for room creation, room existence checks, and sending messages with optimistic updates and error handling.",
  "frontend/src/hooks/useVisualViewportOffset.ts": "Tracks visual viewport changes on mobile to detect keyboard height and provide bottom offset state.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, mobile viewport fixes, safe-area handling, and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/chatErrorMessages.ts": "Maps backend and network errors to sanitized, user-friendly chat error messages.",
  "frontend/src/utils/chatOperationErrors.ts": "Defines structured chat operation errors, transient error detection, and detailed console logging utilities.",
  "frontend/src/utils/downloadImage.ts": "Provides deprecated helpers to download images from URLs or blobs, ensuring PNG filenames and using anchor-based downloads.",
  "frontend/src/utils/downloadMedia.ts": "Offers PNG-converting image downloads and MP4 video downloads (with progress), with fallbacks for CORS issues.",
  "frontend/src/utils/retry.ts": "Implements transient-error detection and an exponential-backoff retry wrapper for async operations.",
  "frontend/src/utils/toastOnce.ts": "Provides deduplicated toast notifications by suppressing repeated messages within a short time window.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, color variables, animations, and plugins.",
  "project_state.json": "Describes current project state, issues, and feature requests related to guest-based room access and messaging fixes."
}