{
  "backend/main.mo": "Motoko canister implementing anonymous chat rooms with message storage, 24-hour TTL filtering, reactions, replies, edits, and media blobs, using Maps and Lists with authorization and blob-storage mixins.",
  "feature_evidence.json": "Machine-readable report listing frontend features related to clickable reply previews, jump-to-message behavior, retry handling for missing messages, affected files, dependencies, and test requirements.",
  "frontend-file-summaries.txt": "Aggregated documentation-style JSON summarizing the purpose and behavior of frontend and backend source files for planning and reference.",
  "frontend/index.html": "HTML entry point defining the root container and loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component managing global theme, room and nickname state, and conditional rendering between the welcome screen and chat room layout.",
  "frontend/src/components/AudioRecorder.tsx": "UI component for recording audio via MediaRecorder with permission handling, duration limits, preview playback, and send/cancel controls.",
  "frontend/src/components/ChatRoom.tsx": "Primary chat interface handling message list rendering, jump-to-message logic, replies, edits, deletions, reactions, media uploads, recording modals, scrolling behavior, and optimistic updates.",
  "frontend/src/components/EmojiPicker.tsx": "Popup emoji picker UI grouped by categories, allowing users to select and insert emojis into messages.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with a copyright notice, heart icon, and external link to caffeine.ai using Tailwind styles.",
  "frontend/src/components/Header.tsx": "Sticky top header showing the SecureChat logo/title and an optional \"Leave Room\" button when a callback is provided.",
  "frontend/src/components/MediaPicker.tsx": "Provides a modal UI for selecting media, including Tenor GIF search, custom sticker uploads with validation, and localStorage persistence with a 24-hour TTL.",
  "frontend/src/components/MessageBubble.tsx": "Displays an individual chat message with avatars, replies, reactions, media (image/audio/video) handling, and controls for reply, edit, delete, and react.",
  "frontend/src/components/VideoRecorder.tsx": "Empty or placeholder file with no implementation.",
  "frontend/src/components/VideoUploader.tsx": "Allows users to select, preview, validate, and upload video files with playback controls, progress simulation, and error handling.",
  "frontend/src/components/WelcomeScreen.tsx": "Landing screen for creating or joining chat rooms, featuring a hero section, feature highlights, and nickname/room code inputs.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity, initializes access control, and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context, hook, and provider for Internet Identity authentication, managing login/logout, identity persistence, and detailed login status using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chat features including room creation, room existence checks, and sending messages with optimistic UI updates via a backend actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles, design tokens via CSS variables, dark mode theming, and mobile-specific viewport, safe-area, and iOS input behavior fixes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and hash-based parameters with sessionStorage support, including safe removal of sensitive hash params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom theme extensions tied to CSS variables, container settings, animations, and additional plugins.",
  "project_state.json": "Project metadata and high-level description of SecureChat, an anonymous real-time chat web app with a React SPA frontend and Internet Computer (Motoko) backend. Enumerates existing features and behaviors (room creation/joining, anonymous sessions, real-time messaging, media, replies, edits/deletes, reactions) with IDs, descriptions, and versions for build planning."
}