{
  "backend/main.mo": "Main chat backend implementing rooms, message storage with TTL, validation, and access control plus mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module converting old message structures to new ones by adding a nonce field and mapping stored messages.",
  "feature_evidence.json": "Report documenting implemented features, affected files, related components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend files and their roles in the chat application.",
  "frontend/index.html": "Base HTML file loading the React app entry point and mounting root container.",
  "frontend/REDEPLOY_TRIGGER.txt": "Redeployment trigger file used to force a production rebuild without code changes.",
  "frontend/src/App.tsx": "Top-level React component managing room state, nickname, and switching between welcome and chat views with normalized room IDs.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI handling permissions, recording, previewing, timing, and sending audio blobs.",
  "frontend/src/components/ChatRoom.tsx": "Full chat interface handling message input, media tools, reactions, sending with nonce deduplication, and message list rendering.",
  "frontend/src/components/EmojiPicker.tsx": "A card-based emoji picker grouped by categories that lets users select an emoji or close the picker.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with logo and an optional button for leaving a room.",
  "frontend/src/components/MediaPicker.tsx": "Provides UI to search Tenor GIFs, add custom stickers, or input URLs, with local storage and upload handling.",
  "frontend/src/components/MessageBubble.tsx": "Renders a chat message with reactions, replies, media previews, timestamps, and actions like edit or delete.",
  "frontend/src/components/VideoRecorder.tsx": "Allows users to record videos via MediaRecorder with live preview, duration limits, and send/cancel options.",
  "frontend/src/components/VideoUploader.tsx": "Handles selecting, validating, previewing, and uploading a video file with progress feedback.",
  "frontend/src/components/WelcomeScreen.tsx": "Landing screen enabling users to create or join rooms with nickname input and room existence checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth state, login, logout, and identity loading.",
  "frontend/src/hooks/usePageVisibility.ts": "Tracks document visibility and returns whether the page is currently visible.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for room creation, room existence, and message sending with optimistic updates and error handling.",
  "frontend/src/hooks/useVisualViewportOffset.ts": "Tracks Visual Viewport changes to compute keyboard offset on mobile devices.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, mobile viewport fixes, and safe-area utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrapped around the root component.",
  "frontend/src/utils/chatErrorMessages.ts": "Converts backend and network errors into user-friendly, anonymized chat error messages.",
  "frontend/src/utils/chatLayoutRegressionCheck.ts": "Development helper that checks chat layout components for visibility and scroll issues.",
  "frontend/src/utils/chatOperationErrors.ts": "Defines a structured chat error object and helpers to create and log errors, including IC reject details.",
  "frontend/src/utils/downloadImage.ts": "Provides deprecated utilities for downloading images or blobs as PNG files using anchor-based downloads.",
  "frontend/src/utils/downloadMedia.ts": "Implements media download utilities including image-to-PNG conversion and video downloads as MP4 with optional progress.",
  "frontend/src/utils/icRejectDetails.ts": "Extracts IC reject codes/messages from nested error objects and gathers candidate error messages.",
  "frontend/src/utils/messageNonce.ts": "Generates cryptographically strong nonces with fallbacks for environments lacking crypto APIs.",
  "frontend/src/utils/retry.ts": "Provides transient error detection and an exponential backoff retry helper.",
  "frontend/src/utils/roomId.ts": "Normalizes room IDs by trimming whitespace.",
  "frontend/src/utils/toastOnce.ts": "Prevents duplicate toasts by tracking recent toast keys within a time window.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, persistence via sessionStorage, and cleanup of URL hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project state file describing current issues with duplicate message sends and delete failures plus existing feature requirements for fixes."
}