{
  "backend/main.mo": "Motoko actor implementing the anonymous chat backend with room management, message storage with 24-hour TTL, reactions, replies, edits, media attachments via blob storage, and admin-only pruning using AccessControl.",
  "feature_evidence.json": "Structured feature evidence report documenting fixes for anonymous message send failures and improved error diagnostics, mapping features to frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Pre-generated high-level summaries of frontend and backend files describing recent improvements across layout, media handling, error diagnostics, access control initialization, and chat functionality.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component managing theme, global layout, room and nickname state, and conditional rendering between the welcome screen and chat room.",
  "frontend/src/components/AudioRecorder.tsx": "Audio recording UI using the MediaRecorder API with permission handling, format negotiation, recording limits, preview playback, and send/cancel controls.",
  "frontend/src/components/ChatRoom.tsx": "Core chat UI handling message display, sending, editing, deleting, reactions, replies, media uploads, scrolling behavior, and error handling via backend query hooks.",
  "frontend/src/components/EmojiPicker.tsx": "Popup component that lets users select emojis from categorized grids and returns the chosen emoji to the parent.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text, a heart icon, and a link attribution to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders a sticky app header with branding and an optional \"Leave Room\" button that triggers a callback when provided.",
  "frontend/src/components/MediaPicker.tsx": "Provides a media selection UI for GIFs, external URLs, and custom stickers, including Tenor API search, local sticker persistence with TTL, and upload validation.",
  "frontend/src/components/MessageBubble.tsx": "Displays an individual chat message with support for replies, reactions, edits, deletes, and rich media (images, audio, video) including playback and downloads.",
  "frontend/src/components/VideoRecorder.tsx": "File is present but contains no implementation or exports.",
  "frontend/src/components/VideoUploader.tsx": "Implements a video upload and preview flow with client-side validation, playback controls, simulated upload progress, and send/cancel actions.",
  "frontend/src/components/WelcomeScreen.tsx": "Landing screen for creating or joining chat rooms, handling nicknames, room validation, retries, and user feedback via toasts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor based on the current Internet Identity, handling authentication, access control initialization, and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login/logout, persisted identities, status tracking, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chat operations including room creation, room existence checks, sending messages with optimistic updates, retries, and structured error handling tied to the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, design tokens, light/dark themes, and mobile-safe viewport utilities with special handling for iOS, safe areas, and chat-specific scrolling behavior.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering App within React Query and Internet Identity providers and importing global styles.",
  "frontend/src/utils/chatErrorMessages.ts": "Provides a sanitizer that converts raw backend, authorization, and network errors into anonymous, user-friendly chat error messages.",
  "frontend/src/utils/chatOperationErrors.ts": "Implements structured chat operation error types, transient error detection, IC reject detail extraction, and standardized console logging helpers.",
  "frontend/src/utils/downloadImage.ts": "Deprecated utilities for downloading images from URLs or blobs using browser anchors, with basic PNG enforcement and fallbacks.",
  "frontend/src/utils/downloadMedia.ts": "Modern media download utilities that convert images to PNG via canvas, download videos as MP4 with progress callbacks, and handle ExternalBlob sources.",
  "frontend/src/utils/retry.ts": "Provides utilities to classify transient errors and retry async operations with configurable exponential backoff, attempt limits, and retry predicates.",
  "frontend/src/utils/toastOnce.ts": "Implements toast deduplication helpers that show error/success/info toasts only once within a short time window to prevent spam.",
  "frontend/src/utils/urlParams.ts": "Utilities to read URL parameters from query strings or hash routing, persist them in sessionStorage, and manage/clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, extensive theme extensions (colors, radius, animations), and plugins.",
  "project_state.json": "Serialized project metadata describing SecureChat’s architecture, feature set, and versioned state, including a detailed list of implemented features."
}