{
  "kind": "build_request",
  "title": "Fix duplicate message sends and failing message deletion in chat",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure all roomId values are normalized consistently (trimmed) across the chat UI and React Query hooks so that sending, fetching, editing, reacting, and deleting messages all target the exact same backend room key and React Query cache key.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its sending each and every message twice where its supposed to send only once, its also showing that its not able to delete messages"
        ]
      },
      "acceptanceCriteria": [
        "When joining/creating a room with leading/trailing spaces in the room code, messages are sent to and fetched from a single consistent room (no split history).",
        "Deleting a message succeeds in the same room where it was created, regardless of whether the room code originally contained leading/trailing whitespace.",
        "React Query cache keys for messages and all message mutations use the same normalized roomId value (no duplicate caches for the same room)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix duplicate message creation by making sendMessage idempotent across retries and UI double-submission: add a client-generated message nonce to the sendMessage call and have the backend deduplicate repeated sends with the same nonce per room, returning the originally-created messageId instead of creating a second message.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its sending each and every message twice where its supposed to send only once"
        ]
      },
      "acceptanceCriteria": [
        "If the frontend retries a send due to transient errors, the backend creates at most one message for that user action and returns the same messageId for subsequent attempts using the same nonce.",
        "If the user triggers send twice quickly for the same composed message payload (e.g., Enter + click, or double click), at most one message is persisted and displayed (no duplicates).",
        "Existing message sending continues to work for text, image, video, and audio payloads."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve delete-message reliability and user feedback: (1) prevent delete from being attempted against optimistic/temporary message IDs, (2) show a clear English error when delete returns false due to ownership mismatch (user can only delete their own messages), and (3) automatically refetch messages after delete success/failure to resync UI state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its also showing that its not able to delete messages"
        ]
      },
      "acceptanceCriteria": [
        "The Delete action is disabled/hidden for optimistic (client-only) messages that do not yet have a real backend messageId.",
        "If a delete attempt fails because the backend returns false (e.g., message not owned by the current userId), the UI shows an English error indicating the user can only delete their own messages (and does not misleadingly imply a system failure).",
        "After a delete attempt (success or failure), the messages list is refetched/invalidated and reflects the backend source of truth (no ghost messages or missing messages due to optimistic cache drift)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add targeted diagnostics (console-only) for duplicate send and delete failures: log a structured console group when sendMessage or deleteMessage fails or returns an unexpected result, including normalized roomId, messageId, whether the message was optimistic, and any available IC reject details, without logging message content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "its sending each and every message twice",
          "its also showing that its not able to delete messages"
        ]
      },
      "acceptanceCriteria": [
        "On send failure or suspected duplicate (same nonce resent), the console includes a structured log group with operation name, normalized roomId, nonce, and IC reject details when available, without logging message text/media URLs.",
        "On delete failure, the console includes a structured log group with operation name, normalized roomId, messageId, isOptimistic flag, backend result (false/exception), and IC reject details when available."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing real-time messaging via WebSockets or push updates.",
    "Adding new authentication providers beyond Internet Identity.",
    "Changing message TTL behavior or introducing external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}