{
  "kind": "build_request",
  "title": "Fix regression: sending messages fails on every attempt",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Identify and fix the root cause of the per-send failure so that sending a message succeeds reliably from the ChatRoom UI. In particular, ensure anonymous users (no Internet Identity) can send messages without backend authorization traps (e.g., remove/relax AccessControl permission checks for core chat operations like `sendMessage`, consistent with the app’s anonymous chat intent).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now it shows an error everytime i try to send a message, fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "From a fresh browser session (not logged into Internet Identity), creating/joining a room and sending a text message succeeds (no inline send error shown in ChatRoom).",
        "From a fresh anonymous session, sending an image-only message succeeds.",
        "From a fresh anonymous session, sending an audio-only message succeeds.",
        "From a fresh anonymous session, sending a video-only message succeeds.",
        "Backend no longer traps with an authorization/permission error for `sendMessage` when called by an anonymous caller."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Improve error diagnostics for message send failures to speed up future debugging: when `useSendMessage` fails, ensure the console log includes IC reject details (reject code/message when present) and the sanitized UI continues to show a stable English message via `sanitizeChatError`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now it shows an error everytime i try to send a message, fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "When a send fails, the browser console contains a grouped log entry for the failed operation including context and any available IC reject_code/reject_message.",
        "User-facing send error text remains sanitized and in English (no raw reject message is displayed in the UI)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new authentication providers or third-party auth systems (Internet Identity remains the only auth option).",
    "Do not introduce external databases or additional backend services.",
    "Do not redesign unrelated chat features (replies, reactions, media picker) beyond what is necessary to restore sending."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}