{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Guest-mode rooms and reliable messaging error handling (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update room create/join and chat send flows to work for guest (anonymous) usage with nickname-only, surfacing user-friendly errors without requiring Internet Identity.",
      "acceptanceCriteria": [
        "From a fresh browser session with no Internet Identity login, the Welcome screen allows entering a nickname + room code and successfully creating a room.",
        "From a fresh browser session with no Internet Identity login, the Welcome screen allows entering a nickname + join code and successfully joining an existing room.",
        "After joining as a guest, sending a text message succeeds and the message appears in the chat UI.",
        "If the backend rejects an operation (e.g., room does not exist, empty nickname), the UI displays an English, user-friendly error message (via existing sanitization) and does not get stuck in a loading state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WelcomeScreen.tsx",
          "operation": "modify",
          "description": "Ensure create/join flows are fully guest-friendly: validate nickname (trim, non-empty, max 20), avoid any UI assumptions that login is required, and rely on caught/trapped backend errors sanitized via sanitizeChatError for user-facing messaging."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align createRoom and sendMessage mutations with guest-mode behavior: keep nickname trimming/validation consistent (max 20), and ensure errors are surfaced by throwing (to be sanitized) rather than interpreting backend return-value sentinels."
        },
        {
          "path": "frontend/src/components/ChatRoom.tsx",
          "operation": "modify",
          "description": "Add/ensure pre-send guest validation for nickname (trim, non-empty, max 20) before attempting send/edit, and keep failure handling retryable with sanitized English messaging (inline/toast) without leaving the UI in a stuck state."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix messaging failures by handling backend traps via caught errors (no sentinel return-value checks) and keeping message fetching resilient with retry/polling behavior.",
      "acceptanceCriteria": [
        "Sending a message no longer checks for messageId === 0n as a failure signal if the backend never returns 0n; failures are handled through caught errors and sanitized messaging.",
        "When sendMessage fails (e.g., room deleted/does not exist), the UI shows 'Unable to send message. Please try again.' (or another appropriate existing sanitized message) and allows retrying.",
        "Message fetching failures do not permanently block the chat view; retry/backoff behavior remains in place where currently implemented."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove messageId === 0n failure checks in useSendMessage; treat failures exclusively as thrown errors (traps/rejects) and continue to sanitize and rethrow for the UI. Also adjust useMessages polling/refetchInterval behavior so transient errors do not permanently stop background refresh."
        },
        {
          "path": "frontend/src/utils/chatErrorMessages.ts",
          "operation": "modify",
          "description": "Review and, if needed, refine sanitizeChatError mappings so send failures resulting from trapped backend errors consistently produce guest-friendly English messages (e.g., 'Unable to send message. Please try again.')."
        },
        {
          "path": "frontend/src/components/ChatRoom.tsx",
          "operation": "modify",
          "description": "Ensure the chat UI does not rely on sentinel values for send success/failure; on send failure, show the existing sanitized message and keep the retry path usable (e.g., preserve unsent payload / allow resend)."
        }
      ]
    }
  ]
}