{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix anonymous send regression and improve send failure diagnostics",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Restore reliable message sending from ChatRoom for anonymous sessions, including text and media-only messages, by ensuring anonymous actor initialization and fixing UI logic that blocks media-only sends.",
      "acceptanceCriteria": [
        "From a fresh browser session (not logged into Internet Identity), creating/joining a room and sending a text message succeeds (no inline send error shown in ChatRoom).",
        "From a fresh anonymous session, sending an image-only message succeeds.",
        "From a fresh anonymous session, sending an audio-only message succeeds.",
        "From a fresh anonymous session, sending a video-only message succeeds.",
        "Backend no longer traps with an authorization/permission error for `sendMessage` when called by an anonymous caller."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure the backend actor is fully initialized for anonymous sessions as well (best-effort call to access-control initialization using the existing secret parameter logic), so core chat operations like sendMessage do not fail due to missing initialization in fresh anonymous browser sessions."
        },
        {
          "path": "frontend/src/components/ChatRoom.tsx",
          "operation": "modify",
          "description": "Fix ChatRoom send gating/validation so media-only messages are allowed from the main composer: include selectedAudio in the early-return validation, include selectedAudio in the send button disabled logic, and ensure selectedAudio is considered when determining whether the user can send without typing text."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Improve frontend diagnostics for send failures by logging IC reject details (when present) while keeping UI errors sanitized via sanitizeChatError.",
      "acceptanceCriteria": [
        "When a send fails, the browser console contains a grouped log entry for the failed operation including context and any available IC reject_code/reject_message.",
        "User-facing send error text remains sanitized and in English (no raw reject message is displayed in the UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/chatOperationErrors.ts",
          "operation": "modify",
          "description": "Enhance IC reject detail extraction to handle additional common error shapes (including nested/cause-style fields) so grouped console logs reliably include reject code/message when provided by the agent/replica, without changing the sanitized message shown to users."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Augment useSendMessage failure logging context to include clearer per-send metadata (e.g., content vs media-only flags) and ensure the raw error passed into createChatOperationError preserves IC reject fields for diagnostics, while continuing to throw only the sanitized English message to the UI via sanitizeChatError."
        }
      ]
    }
  ]
}