{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project involves room-based messaging; user reports inability to create/join rooms and send/receive messages, and requests that users be able to join with a nickname (guest) without requiring Internet Identity.",
  "architectural_notes": [
    "Support guest/unauthenticated users identified by nickname for room join flow (do not require Internet Identity for joining)."
  ],
  "known_issues": [
    "Users are unable to create or join rooms (UI shows: \"Unable to create room. Please try again or join an existing room.\").",
    "Users are unable to send or receive messages (generic error while sending)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-frontend-room-create-join-and-message-send-flows-to-work-in-guest-mode-anonymous-actor-without-requiring-internet-identity-and-ensure-errors-are-surfaced-as-clear-guest-friendly-messages-instead-of-generic-failures",
      "title": "Update frontend room create/join and message send flows to work in guest mode (anonymous actor) without requiring Internet Identity, and ensure errors are surfaced as clear guest-friendly messages instead of generic failures.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-the-unable-to-send-or-receive-messages-failure-mode-by-aligning-frontend-expectations-with-backend-behavior-backend-traps-on-failure-frontend-should-not-rely-on-sentinel-return-values-like-messageid-0n",
      "title": "Fix the \"unable to send or receive messages\" failure mode by aligning frontend expectations with backend behavior (backend traps on failure; frontend should not rely on sentinel return values like messageId === 0n).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Allow users to join rooms as guests using only a nickname (no Internet Identity required)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Remove the requirement for Internet Identity / AccessControl \"#user\" permission for core chat operations so that any caller can create rooms, read messages, and send messages using only a nickname.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add backend-side validation for guest identity inputs so nickname-based usage is safe and consistent: require a non-empty nickname, trim whitespace, and enforce a reasonable max length consistent with the frontend (20 chars).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Allow guest users to join/create rooms with only a nickname (no Internet Identity required) and restore messaging",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}